Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/edc/PIC32MZ1024EFK064.PIC
      <edc:SFRDef edc:_addr="0x1F820640" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="I2C4BRG" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="I2C4BRG" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C4">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CBRG" edc:desc="" edc:mask="0xffff" edc:name="I2CBRG" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820650" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="3" edc:access="------------------------wwwwwwww" edc:cname="I2C4TRN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------11111111" edc:name="I2C4TRN" edc:nzwidth="32" edc:por="------------------------11111111" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C4">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CTRN" edc:desc="" edc:mask="0xff" edc:name="I2CTRN" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820660" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="3" edc:access="------------------------rrrrrrrr" edc:cname="I2C4RCV" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="I2C4RCV" edc:nzwidth="32" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C4">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CRCV" edc:desc="" edc:mask="0xff" edc:name="I2CRCV" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F820670" edc:offset="400"/>
      <edc:SFRDef edc:_addr="0x1F820800" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="4" edc:access="---------nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="I2C5CON" edc:desc="" edc:impl="0x7fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------00000000x01000000000000" edc:name="I2C5CON" edc:nzwidth="32" edc:por="---------00000000x01000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="I2C5">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEN" edc:desc="" edc:mask="0x1" edc:name="SEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RSEN" edc:desc="" edc:mask="0x1" edc:name="RSEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PEN" edc:desc="" edc:mask="0x1" edc:name="PEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RCEN" edc:desc="" edc:mask="0x1" edc:name="RCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACKEN" edc:desc="" edc:mask="0x1" edc:name="ACKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACKDT" edc:desc="" edc:mask="0x1" edc:name="ACKDT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="STREN" edc:desc="" edc:mask="0x1" edc:name="STREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GCEN" edc:desc="" edc:mask="0x1" edc:name="GCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SMEN" edc:desc="" edc:mask="0x1" edc:name="SMEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DISSLW" edc:desc="" edc:mask="0x1" edc:name="DISSLW" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="A10M" edc:desc="" edc:mask="0x1" edc:name="A10M" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="STRICT" edc:desc="" edc:mask="0x1" edc:name="STRICT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SCLREL" edc:desc="" edc:mask="0x1" edc:name="SCLREL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DHEN" edc:desc="" edc:mask="0x1" edc:name="DHEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AHEN" edc:desc="" edc:mask="0x1" edc:name="AHEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SBCDE" edc:desc="" edc:mask="0x1" edc:name="SBCDE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SDAHT" edc:desc="" edc:mask="0x1" edc:name="SDAHT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BOEN" edc:desc="" edc:mask="0x1" edc:name="BOEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SCIE" edc:desc="" edc:mask="0x1" edc:name="SCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PCIE" edc:desc="" edc:mask="0x1" edc:name="PCIE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="11"/>
            <edc:SFRFieldDef edc:cname="IPMIEN" edc:desc="" edc:mask="0x1" edc:name="IPMIEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="I2CSIDL" edc:desc="" edc:mask="0x1" edc:name="I2CSIDL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="I2CEN" edc:desc="" edc:mask="0x1" edc:name="I2CEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="I2C 5" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820810" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="4" edc:access="----------------rrr--crrccrccrrr" edc:cname="I2C5STAT" edc:desc="" edc:impl="0xe7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000--00000000000" edc:name="I2C5STAT" edc:nzwidth="32" edc:por="----------------000--00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C5">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TBF" edc:desc="" edc:mask="0x1" edc:name="TBF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RBF" edc:desc="" edc:mask="0x1" edc:name="RBF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="R_W" edc:desc="" edc:mask="0x1" edc:name="R_W" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="S" edc:desc="" edc:mask="0x1" edc:name="S" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="P" edc:desc="" edc:mask="0x1" edc:name="P" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="D_A" edc:desc="" edc:mask="0x1" edc:name="D_A" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2COV" edc:desc="" edc:mask="0x1" edc:name="I2COV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IWCOL" edc:desc="" edc:mask="0x1" edc:name="IWCOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADD10" edc:desc="" edc:mask="0x1" edc:name="ADD10" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GCSTAT" edc:desc="" edc:mask="0x1" edc:name="GCSTAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BCL" edc:desc="" edc:mask="0x1" edc:name="BCL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ACKTIM" edc:desc="" edc:mask="0x1" edc:name="ACKTIM" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRSTAT" edc:desc="" edc:mask="0x1" edc:name="TRSTAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACKSTAT" edc:desc="" edc:mask="0x1" edc:name="ACKSTAT" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="I2CPOV" edc:desc="" edc:mask="0x1" edc:name="I2CPOV" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820820" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="4" edc:access="----------------------nnnnnnnnnn" edc:cname="I2C5ADD" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="I2C5ADD" edc:nzwidth="32" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C5">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CADD" edc:desc="" edc:mask="0x3ff" edc:name="I2CADD" edc:nzwidth="10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820830" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="4" edc:access="----------------------nnnnnnnnnn" edc:cname="I2C5MSK" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="I2C5MSK" edc:nzwidth="32" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C5">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CMSK" edc:desc="" edc:mask="0x3ff" edc:name="I2CMSK" edc:nzwidth="10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="AMSK" edc:desc="" edc:mask="0x3ff" edc:name="AMSK" edc:nzwidth="10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820840" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="I2C5BRG" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="I2C5BRG" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C5">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CBRG" edc:desc="" edc:mask="0xffff" edc:name="I2CBRG" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820850" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="4" edc:access="------------------------wwwwwwww" edc:cname="I2C5TRN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------11111111" edc:name="I2C5TRN" edc:nzwidth="32" edc:por="------------------------11111111" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C5">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CTRN" edc:desc="" edc:mask="0xff" edc:name="I2CTRN" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820860" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="4" edc:access="------------------------rrrrrrrr" edc:cname="I2C5RCV" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="I2C5RCV" edc:nzwidth="32" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C5">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CRCV" edc:desc="" edc:mask="0xff" edc:name="I2CRCV" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F820870" edc:offset="1936"/>
      <edc:SFRDef edc:_addr="0x1F821000" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-01329_spi_pb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnn-----nnnnnnnnnnnnnnnnnn" edc:cname="SPI1CON" edc:desc="" edc:grp="SPI" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000x-----0000000000000x0000" edc:name="SPI1CON" edc:nzwidth="0x20" edc:por="00000000x-----0000000000000x0000" edc:portals="CLR SET INV" ltx:baseofperipheral="SPI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SRXISEL" edc:desc="" edc:mask="0x3" edc:name="SRXISEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="STXISEL" edc:desc="" edc:mask="0x3" edc:name="STXISEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DISSDI" edc:desc="" edc:mask="0x1" edc:name="DISSDI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="MSTEN" edc:desc="" edc:mask="0x1" edc:name="MSTEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKP" edc:desc="" edc:mask="0x1" edc:name="CKP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSEN" edc:desc="" edc:mask="0x1" edc:name="SSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKE" edc:desc="" edc:mask="0x1" edc:name="CKE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMP" edc:desc="" edc:mask="0x1" edc:name="SMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE16" edc:desc="" edc:mask="0x1" edc:name="MODE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE32" edc:desc="" edc:mask="0x1" edc:name="MODE32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DISSDO" edc:desc="" edc:mask="0x1" edc:name="DISSDO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENHBUF" edc:desc="" edc:mask="0x1" edc:name="ENHBUF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIFE" edc:desc="" edc:mask="0x1" edc:name="SPIFE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="MCLKSEL" edc:desc="" edc:mask="0x1" edc:name="MCLKSEL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRMCNT" edc:desc="" edc:mask="0x7" edc:name="FRMCNT" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="FRMSYPW" edc:desc="" edc:mask="0x1" edc:name="FRMSYPW" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSSEN" edc:desc="" edc:mask="0x1" edc:name="MSSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRMPOL" edc:desc="" edc:mask="0x1" edc:name="FRMPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRMSYNC" edc:desc="" edc:mask="0x1" edc:name="FRMSYNC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRMEN" edc:desc="" edc:mask="0x1" edc:name="FRMEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="SPI/I2S 1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F821010" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-01329_spi_pb_v2.Module" edc:_refcount="1" edc:access="---rrrrr---rrrrr---nr--rrrr-r-rr" edc:cname="SPI1STAT" edc:desc="" edc:grp="SPI" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---x0--0000-0-00" edc:name="SPI1STAT" edc:nzwidth="0x20" edc:por="---00000---00000---x0--0000-0-00" edc:portals="CLR SET INV" ltx:memberofperipheral="SPI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPIRBF" edc:desc="" edc:mask="0x1" edc:name="SPIRBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPITBF" edc:desc="" edc:mask="0x1" edc:name="SPITBF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPITBE" edc:desc="" edc:mask="0x1" edc:name="SPITBE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPIRBE" edc:desc="" edc:mask="0x1" edc:name="SPIRBE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIROV" edc:desc="" edc:mask="0x1" edc:name="SPIROV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRMT" edc:desc="" edc:mask="0x1" edc:name="SRMT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPITUR" edc:desc="" edc:mask="0x1" edc:name="SPITUR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SPIBUSY" edc:desc="" edc:mask="0x1" edc:name="SPIBUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRMERR" edc:desc="" edc:mask="0x1" edc:name="FRMERR" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="TXBUFELM" edc:desc="" edc:mask="0x1f" edc:name="TXBUFELM" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RXBUFELM" edc:desc="" edc:mask="0x1f" edc:name="RXBUFELM" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F821020" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-01329_spi_pb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SPI1BUF" edc:desc="" edc:grp="SPI" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="SPI1BUF" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="SPI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI1BUF" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="SPI1BUF" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F821030" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-01329_spi_pb_v2.Module" edc:_refcount="1" edc:access="-------------------nnnnnnnnnnnnn" edc:cname="SPI1BRG" edc:desc="" edc:grp="SPI" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------xxxxxxxxxxxxx" edc:name="SPI1BRG" edc:nzwidth="0x20" edc:por="-------------------xxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="SPI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI1BRG" edc:desc="" edc:islanghidden="true" edc:mask="0x1fff" edc:name="SPI1BRG" edc:nzwidth="13"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F821040" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-01329_spi_pb_v2.Module" edc:_refcount="1" edc:access="----------------n--nnnnnn---n-nn" edc:cname="SPI1CON2" edc:desc="" edc:impl="0x9f8b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x--xxxxxx---x-xx" edc:name="SPI1CON2" edc:nzwidth="32" edc:por="----------------x--xxxxxx---x-xx" edc:portals="CLR SET INV" ltx:memberofperipheral="SPI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AUDMOD" edc:desc="" edc:mask="0x3" edc:name="AUDMOD" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="AUDMONO" edc:desc="" edc:mask="0x1" edc:name="AUDMONO" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AUDEN" edc:desc="" edc:mask="0x1" edc:name="AUDEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IGNTUR" edc:desc="" edc:mask="0x1" edc:name="IGNTUR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IGNROV" edc:desc="" edc:mask="0x1" edc:name="IGNROV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPITUREN" edc:desc="" edc:mask="0x1" edc:name="SPITUREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPIROVEN" edc:desc="" edc:mask="0x1" edc:name="SPIROVEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRMERREN" edc:desc="" edc:mask="0x1" edc:name="FRMERREN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SPISGNEXT" edc:desc="" edc:mask="0x1" edc:name="SPISGNEXT" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="AUDMOD0" edc:desc="" edc:mask="0x1" edc:name="AUDMOD0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AUDMOD1" edc:desc="" edc:mask="0x1" edc:name="AUDMOD1" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
